<!DOCTYPE html>
<html lang="es">
<head>
    <title>Ejercicio 1 Cristina D&iacute;az</title>
</head>
<body style="text-align:center;" style="background-color:antiquewhite;">

<strong><h1 title="Header" style="font-size:60px;">Redes peer-to-peer:</h1></strong>
<p style="color:#6495ED;background-color:rgb(127, 255, 212);">El software de cliente y servidor suele ejecutarse en ordenadores diferentes, pero
    tambi&eacute;n se puede disponer de un ordenador que desempe&ntilde;e los dos papeles al mismo
    tiempo. En entornos peque&ntilde;os, muchos ordenadores funcionan como servidores y
    clientes de la red. Este tipo de red se denomina <q>Red Peer-to-Peer</q>. </p>
<p title="Segundo párrafo"><pre>La red peer-to-peer m&aacute;s sencilla est&aacute; compuesta por dos ordenadores conectados
    directamente mediante una conexi&oacute;n cableada o inal&aacute;mbrica. Tambi&eacute;n pueden
    conectarse varios PC&acute;s para crear una red peer-to-peer de mayor tama&ntilde;o, aunque para
    ello hace falta un dispositivo de red, como un hub, para interconectar los ordenadores.
    La principal desventaja de un entorno de red peer-to-peer es que el rendimiento de un
    host puede disminuir cuando act&uacute;a como cliente y como servidor al mismo tiempo.</pre></p>
<p style="font-family:courier;font-size:50%;"><b><i><small>En la Fig. 4</small>, un ordenador conectado a una red peer-to-peer dispone de una impresora
    local que puede compartir con otro ordenador conectado a la red. El primer ordenador
    est&aacute; actuando como servidor de impresi&oacute;n, mientras que el otro act&uacute;a como servidor
    de archivos y proporciona acceso a los archivos en &eacute;l almacenados. Estos dos
    ordenadores est&aacute;n conectados de forma directa sin ning&uacute;n dispositivo de red.</i></b></p>

<hr>

<a href="https://www.uma.es/etsi-informatica/">Link a la p&aacute;gina de la <del>Facultad</del> Escuela de Inform&aacute;tica</a>
<br>
<br>
<img style="border:2px solid hsl(50, 100%, 64%);" src="https://www.uma.es/media/cache/e9/94/e99423112f294e8026c2ed7ca31e88a2.jpg" alt="E.T.S.I.I." width="300" height="250">


<p>En este texto no se habla de sub&iacute;ndices, x<sub>0</sub> ni super&iacute;ndices, x<sup>2</sup>.</p>

<!-- á: &aacute;
     é: &eacute;
     í: &iacute;
     ó: &oacute;
     ú: &uacute;
     ñ: &ntilde; -->
</body>
</html>